snlkuharlocal/src/DataProcessors/АРМ_РаботаСРезервамиПодПланыПродаж/АРМ_РаботаСРезервамиПодПланыПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АРМ_РаботаСРезервамиПодПланыПродаж</name>
  <attributes>
    <name>НачальныйМесяцПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПланаПродаж</name>
    <type>
      <types>CatalogRef.ВидыПланаПродаж</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МесяцаПланированияНоменклатуры</name>
    <attributes>
      <name>КоличествоМесяцев</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Уровень</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыСоздаваемойНакладной</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/AccumulationRegisters/ОстаткиПлановПродаж/ОстаткиПлановПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПлановПродаж</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПланаПродаж</name>
    <type>
      <types>CatalogRef.ВидыПланаПродаж</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/InformationRegisters/РаспределениеПлановПродажПоНакладным/РаспределениеПлановПродажПоНакладным.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаспределениеПлановПродажПоНакладным</name>
  <dimensions>
    <name>ПланПродаж</name>
    <type>
      <types>DocumentRef.ПланПродаж</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/ПланПродаж/ПланПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланПродаж</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.ПланПродаж</registerRecords>
  <registerRecords>AccumulationRegister.ПланПродажШтуки</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПлановПродаж</registerRecords>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТовара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Детальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентИзмененияКоличества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасчетаЦенПоМатрице</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьПриРасчетеЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПланаПродаж</name>
    <type>
      <types>CatalogRef.ВидыПланаПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеныРассчитаны</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>ТипТовара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Брэнд</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТоварныйЗапас</name>
      <comment>Товарный запас в днях торговли</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазовоеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКомплектующих</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатрицыДляРасчетаЦен</name>
    <attributes>
      <name>Матрица</name>
      <type>
        <types>DocumentRef.Матрица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/АРМ_РаботаСРезервамиПодПланыПродаж/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

// Инициализирует данные при создании формы на сервере.
// Получает информацию об основной информационной базе и контрагенте 
// с неизменяемым остатком для дальнейшего использования в обработке.
//
// Параметры:
//  Отказ - Булево - параметр стандартного обработчика для возможности отказа от создания
//  СтандартнаяОбработка - Булево - параметр стандартного обработчика для управления стандартной обработкой
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)     
	
	Если ОбщегоНазначения_ПИ.ПрочитатьРСРеквизитСправочника_ПИ("ОтключитьРасчетОстаткаПланов", Неопределено, Ложь) Тогда	    
		ВызватьИсключение "Снимите признак ОтключитьРасчетОстаткаПланов в РС реквизиты справочников";
	КонецЕсли;
	
	ИБ = ОбщегоНазначения_ПИ.ПолучитьОсновнуюИБ();
	НеизменяемыйОстаток = ОбщегоНазначения_ПИ.ПолучитьКонтрагентаНеИзменяемыйОстаток();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы   

// Очищает заполненные значения формы при изменении контрагента для обеспечения корректной работы АРМ
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)   
	
	ЗачиститьЗначенияФормы();
	
КонецПроцедуры


// Обработчик события изменения реквизита ВидПланаПродаж
&НаКлиенте
Процедура ВидПланаПродажПриИзменении(Элемент) 
	
	ЗачиститьЗначенияФормы();  
	
КонецПроцедуры

// Обработчик изменения начального месяца планирования. Очищает значения на форме.
&НаКлиенте
Процедура НачальныйМесяцПланированияПриИзменении(Элемент)  
	
	ЗачиститьЗначенияФормы();   
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМесяцаПланированияНоменклатуры 

// Очищает значения на форме при изменении месяца планирования в строке номенклатуры
&НаКлиенте
Процедура МесяцаПланированияНоменклатурыПриИзменении(Элемент)
	
	ЗачиститьЗначенияФормы();
	
КонецПроцедуры

// Обрабатывает событие изменения номенклатуры в строке табличной части МесяцаПланированияНоменклатуры.
// Определяет уровень номенклатуры через серверную функцию и пересчитывает порядок строк планирования.
// Параметры:
//  Элемент - УправляемаяФорма - Элемент управления, вызвавший событие
&НаКлиенте
Процедура МесяцаПланированияНоменклатурыНоменклатураПриИзменении(Элемент)
	
	ИдентификаторСтроки = Элементы.МесяцаПланированияНоменклатуры.ТекущаяСтрока;		
	СтрокаТаблицы = Объект.МесяцаПланированияНоменклатуры.НайтиПоИдентификатору(ИдентификаторСтроки);
	Номенклатура = СтрокаТаблицы.Номенклатура;
	СтрокаТаблицы.Уровень = ОбщегоНазначенияС.ОпределитьУровеньНоменклатуры(Номенклатура);
	РасчитатьПорядокСтрокПланирования();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПланов 

// Обработчик события ПередУдалением табличной части ТаблицаПланов. Запрещает удаление строк.
//
// Параметры:
//  Элемент  - ДанныеФормыЭлементДерева - элемент управления табличным полем
//  Отказ    - Булево - признак отказа от удаления. Установка значения Истина запрещает удаление.
&НаКлиенте
Процедура ТаблицаПлановПередУдалением(Элемент, Отказ) 
	
	Отказ = Истина;  
	
КонецПроцедуры

// Открывает план продаж, выбранный в табличной части "ТаблицаПланов"
&НаКлиенте
Процедура ТаблицаПлановВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.ТаблицаПланов.ТекущиеДанные;
	#Если Не ВебКлиент Тогда
		ОткрытьЗначение(ТекСтрока.ПланПродаж);
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТоварыСоздаваемойНакладной 
// Блокирует добавление строк в табличную часть "ТоварыСоздаваемойНакладной".
// Заполнение табличной части выполняется программно.
&НаКлиенте
Процедура ТоварыСоздаваемойНакладнойПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;       
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

// Создает расходную накладную на планы продаж.
// Проверяет наличие пункта доставки или расходной накладной и вызывает серверную процедуру создания.
&НаКлиенте
Процедура СоздатьРНКНаПланыПродаж(Команда)
	
	Если Не ЗначениеЗаполнено(ПунктДоставки) И Не ЗначениеЗаполнено(РасходнаяНакладная) Тогда
		ОбщегоНазначенияК.СообщитьПользователю("Укажите пункт доставки или существующую накладную");
	КонецЕсли;
	
	Результат = СоздатьРНКНаПланыПродажНаСервере();
	Если Не Результат.Успешно Тогда
		ОбщегоНазначенияК.СообщитьПользователю(СтрСоединить(Результат.Ошибки, ", "));
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму выбора номенклатуры для подбора в табличную часть МесяцаПланированияНоменклатуры.
// Поддерживает множественный выбор и выбор групп и элементов.
&НаКлиенте
Процедура ПодборНоменклатурыВМесяцаПланирования(Команда)     
	
	ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ПослеВыбораНоменклатуры", ЭтотОбъект);
	ПараметрОткрытияФормы = Новый Структура("РежимВыбора,МножественныйВыбор", Истина, Истина);
	ПараметрОткрытияФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбораУпр", ПараметрОткрытияФормы, ЭтотОбъект, , , ,
	ОписаниеОповещенияВыбор);     
	
КонецПроцедуры

// Заполняет таблицу планирования данными из текущих планов продаж
//
// Параметры:
//  Команда - КомандаФормы - команда, вызвавшая процедуру
//
&НаКлиенте
Процедура ЗаполнитьТаблицуПланированияИзТекущихПланов(Команда)
	
	Результат = ЗаполнитьТаблицуПланированияИзТекущихПлановНаСервере();
	Если Не Результат.Успешно Тогда
		ОбщегоНазначенияК.СообщитьПользователю(СтрСоединить(Результат.Ошибки,", "));
	КонецЕсли;
	
КонецПроцедуры

// Заполняет товары планирования для РНК на основе выбранных месяцев и номенклатуры
//
// Параметры:
//  Команда - КомандаФормы - стандартный параметр обработчика команды
//
// Предусловия:
//  В табличной части МесяцаПланированияНоменклатуры должны быть заполнены записи
//
&НаКлиенте
Процедура ЗаполнитьТоварыПланированияДляРНК(Команда)  
	
	Если Объект.МесяцаПланированияНоменклатуры.Количество() = 0 Тогда
		ОбщегоНазначенияК.СообщитьПользователю("Заполните месяца и номенклатуру планирования");   
		Возврат;
	КонецЕсли;  
	
	ЗаполнитьТоварыПланированияДляРНКНаСервере(); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Очищает заполненные значения на форме: табличную часть ТоварыСоздаваемойНакладной,
// переменную РасходнаяНакладная и таблицу планов.
&НаКлиенте
Процедура ЗачиститьЗначенияФормы()      
	
	Объект.ТоварыСоздаваемойНакладной.Очистить();
	РасходнаяНакладная = Неопределено;
	ТаблицаПланов.Очистить();
	
КонецПроцедуры

// Добавляет новую строку в табличную часть МесяцаПланированияНоменклатуры, если номенклатура еще не добавлена
//
// Параметры:
//  ВыбЭлемент - СправочникСсылка.Номенклатура - ссылка на номенклатуру для добавления в табличную часть
//
&НаКлиенте
Процедура ДобавитьНовуюСтрокуМесяцаПланированияНоменклатуры(Знач ВыбЭлемент)
	
	Перем Отбор;
	Отбор = Новый Структура("Номенклатура", ВыбЭлемент);
	СтрокиТоваров = Объект.МесяцаПланированияНоменклатуры.НайтиСтроки(Отбор);
	Если СтрокиТоваров.Количество() = 0 Тогда
		СтрокаТовара = Объект.МесяцаПланированияНоменклатуры.Добавить();
		СтрокаТовара.Номенклатура = ВыбЭлемент;
		
		#Если Не ВебКлиент И Не ТонкийКлиент Тогда
			СтрокаТовара.Уровень = ВыбЭлемент.Уровень();
		#Иначе
			СтрокаТовара.Уровень = ОбщегоНазначенияС.ОпределитьУровеньНоменклатуры(ВыбЭлемент);
		#КонецЕсли      
		
		СтрокаТовара.КоличествоМесяцев = 1;
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик оповещения после выбора номенклатуры в форме.
// Добавляет выбранные элементы номенклатуры в таблицу планирования
// и выполняет пересчет порядка строк.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - выбранное значение или массив выбранных значений номенклатуры
//                           (может быть Массив из СправочникСсылка.Номенклатура или одиночная СправочникСсылка.Номенклатура)
//  ДопПараметры - Произвольный - дополнительные параметры оповещения
//
&НаКлиенте
Процедура ПослеВыбораНоменклатуры(ВыбранноеЗначение, ДопПараметры) Экспорт       
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого ВыбЭлемент Из ВыбранноеЗначение Цикл
			ДобавитьНовуюСтрокуМесяцаПланированияНоменклатуры(ВыбЭлемент);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда
		ДобавитьНовуюСтрокуМесяцаПланированияНоменклатуры(ВыбранноеЗначение);
	КонецЕсли;      
	
	РасчитатьПорядокСтрокПланирования();
	
КонецПроцедуры

// Выполняет запись документов с переносом остатков плана продаж
//
// Параметры:
//  ТаблицаОбъектовЗаписи - ТаблицаЗначений - таблица с объектами для записи (должна содержать колонку "Объект")
//  МассивПланов - Массив из ДокументСсылка.ПланПродаж - массив планов продаж для формирования связки с накладной
//
// Возвращаемое значение:
//  Структура - структура результата выполнения:
//   * Ошибки - Массив Из Строка - Коллекция ошибок, возникших при записи
//   * Успешно - Булево - признак успешного выполнения всех операций
//
&НаСервере
Функция ВыполнитьЗаписьДокументовСПереносомОстатковПлана (ТаблицаОбъектовЗаписи, Знач МассивПланов)   
	
	СтруктураРезультата = МаркировкаКС.СтруктураРезультата();

	НачатьТранзакцию();

	ТекОбъект = Неопределено;
	ЕстьОшибки = Ложь;
	Попытка
		Для Каждого СтрокаОбъекта Из ТаблицаОбъектовЗаписи Цикл
			ТекОбъект = СтрокаОбъекта.Объект;

			ТекОбъект.Записать();
			Если ТипЗнч(ТекОбъект) = Тип("ДокументОбъект.ПланПродаж") Тогда
				РегистрыНакопления.ОстаткиПлановПродаж.СформироватьИЗаписатьДвижения(ТекОбъект);
				ТекОбъект.Движения.ОстаткиПлановПродаж.Записать(Истина);
			КонецЕсли;

		КонецЦикла;

		РегистрыСведений.РаспределениеПлановПродажПоНакладным.ЗаписатьСвязкуПлановСНакладной(
			РасходнаяНакладная, МассивПланов);

	Исключение
		ЕстьОшибки = Истина;
		СтруктураРезультата.Ошибки.Добавить(СтрШаблон("Не удалось записать %1, из-за %2",
			ТекОбъект, ОписаниеОшибки()));
		ОтменитьТранзакцию();
	КонецПопытки;

	Если Не ЕстьОшибки Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	Если СтруктураРезультата.Ошибки.Количество() > 0 Тогда 
		СтруктураРезультата.Успешно = Ложь;
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции

&НаСервере
Функция СоздатьРНКНаПланыПродажНаСервере()
	
	СтруктураРезультата = МаркировкаКС.СтруктураРезультата();
	
	Результат = НайтиСоздатьРНКНаПланы ();   
	
	Если Не Результат.Успешно Тогда
		МаркировкаКС.ДобавитьОшибки(СтруктураРезультата, Результат)
	КонецЕсли;
	
	Если СтруктураРезультата.Ошибки.Количество() > 0 Тогда 
		СтруктураРезультата.Успешно = Ложь;
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции

// Пересчитывает порядок строк в табличной части МесяцаПланированияНоменклатуры по уровню иерархии и номеру строки
//
// Процедура выполняет сортировку строк по уровню (убыв) и номеру строки,
// затем присваивает последовательные номера порядка для строк с одинаковой номенклатурой
&НаСервере
Процедура РасчитатьПорядокСтрокПланирования()
	
	ТаблицаСтрок = Объект.МесяцаПланированияНоменклатуры.Выгрузить();
	ТаблицаСтрок.Сортировать("Уровень Убыв, НомерСтроки");
	Порядок = 1;
	Для Каждого СтрокаТаблицы Из ТаблицаСтрок Цикл
		Отбор = Новый Структура("Номенклатура", СтрокаТаблицы.Номенклатура);
		МассивСтрокТЧ = Объект.МесяцаПланированияНоменклатуры.НайтиСтроки(Отбор);
		Для Каждого СтрокаТЧ Из МассивСтрокТЧ Цикл
			СтрокаТЧ.Порядок = Порядок;
			Порядок = Порядок + 1;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет табличную часть МесяцаПланированияНоменклатуры номенклатурой из проведенных
// планов продаж за указанный месяц для контрагента. Добавляет группы номенклатуры
// верхнего уровня.
//
// Возвращаемое значение:
//  Структура - структура результата выполнения:
//   * Ошибки - Массив из Строка - список текстов ошибок валидации (если есть)
//   * Успешно - Булево - Истина, если заполнение выполнено успешно
//
&НаСервере
Функция ЗаполнитьТаблицуПланированияИзТекущихПлановНаСервере()
	
	Объект.МесяцаПланированияНоменклатуры.Очистить();
	
	СтруктураРезультата = МаркировкаКС.СтруктураРезультата();
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		СтруктураРезультата.Ошибки.Добавить("Укажите контрагента");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.НачальныйМесяцПланирования) Тогда
		СтруктураРезультата.Ошибки.Добавить("Укажите начальный месяц планирования");
	КонецЕсли;
	
	Если СтруктураРезультата.Ошибки.Количество() = 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Объект.НачальныйМесяцПланирования));
		Запрос.УстановитьПараметр("Дата2", КонецМесяца(Объект.НачальныйМесяцПланирования));
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);	
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПланПродажСостав.Номенклатура.Родитель.Родитель КАК Номенклатура
		|ИЗ
		|	Документ.ПланПродаж.Состав КАК ПланПродажСостав
		|ГДЕ
		|	ПланПродажСостав.Ссылка.Проведен
		|	И ПланПродажСостав.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
		|	И ПланПродажСостав.Ссылка.Контрагент = &Контрагент
		|ИТОГИ
		|ПО
		|	Номенклатура ТОЛЬКО ИЕРАРХИЯ";
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		Пока Выборка.Следующий() Цикл
			Номенклатура = Выборка.Номенклатура;
			Если Не ЗначениеЗаполнено(Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			Уровень = Номенклатура.Уровень();
			Если Не Уровень = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТЧ = Объект.МесяцаПланированияНоменклатуры.Добавить();
			СтрокаТЧ.Уровень = Уровень;
			СтрокаТЧ.КоличествоМесяцев = 1;
			СтрокаТЧ.Номенклатура = Номенклатура;
		КонецЦикла;
		
		РасчитатьПорядокСтрокПланирования();
		
	КонецЕсли;
	
	Если СтруктураРезультата.Ошибки.Количество() = 0 Тогда
		СтруктураРезультата.Успешно = Истина;
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции


// Ищет или создает расходную накладную на планы продаж для переноса товаров из остатков планов.
//
// Функция выполняет следующие действия:
// 1. Ищет существующую проведенную расходную накладную для контрагента неизменяемого остатка
//    с указанной номенклатурой, пунктом доставки и датой не менее даты запрета редактирования
// 2. Если накладная не найдена, создает новую расходную накладную с заполнением обязательных реквизитов
// 3. Переносит товары из остатков планов в найденную или созданную расходную накладную
//
// Возвращаемое значение:
//  Структура - структура результата операции, содержащая:
//   * Успешно - Булево - признак успешного выполнения операции
//   * Ошибки - Массив из Строка - список текстов ошибок при выполнении операции
//
&НаСервере
Функция НайтиСоздатьРНКНаПланы ();    
	
	СтруктураРезультата = МаркировкаКС.СтруктураРезультата();
	
	МассивНоменклатуры = Объект.ТоварыСоздаваемойНакладной.Выгрузить(,"Номенклатура").ВыгрузитьКолонку("Номенклатура");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	РасходнаяНакладная.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Проведен
	|	И РасходнаяНакладная.Контрагент = &Контрагент
	|	И РасходнаяНакладная.Дата >= &Дата
	|	И РасходнаяНакладная.Товары.Номенклатура В(&МассивНоменклатуры)
	|	И РасходнаяНакладная.ПунктДоставки = &ПунктДоставки";
	
	Запрос.УстановитьПараметр("Контрагент",НеизменяемыйОстаток);
	Запрос.УстановитьПараметр("Дата",ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования());
	Запрос.УстановитьПараметр("МассивНоменклатуры",МассивНоменклатуры);
	Запрос.УстановитьПараметр("ПунктДоставки",ПунктДоставки);     
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		РасходнаяНакладная = Выборка.Ссылка;
	КонецЦикла;                
	
	Если Не ЗначениеЗаполнено(РасходнаяНакладная) Тогда       
		РасходнаяНакладнаяОбъект = Документы.РасходнаяНакладная.СоздатьДокумент();
		РасходнаяНакладнаяОбъект.Контрагент = НеизменяемыйОстаток;     
		РасходнаяНакладнаяОбъект.ПунктДоставки = ПунктДоставки; 
		РасходнаяНакладнаяОбъект.Дата = ТекущаяДатаСеанса(); 	     
		РасходнаяНакладнаяОбъект.Склад = ОбщегоНазначенияС.ПрочитатьРСРеквизитСправочникаСервер("СкладНеизменяемогоОстаткаДСП",
		Неопределено, Справочники.Склады.ПустаяСсылка()); 	
		
		ЗаполнитьШапкуДокумента(РасходнаяНакладнаяОбъект,ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац);      
		
		РасходнаяНакладнаяОбъект.Менеджер = ОбщегоНазначенияС.ПолучитьРеквизитШапкиСервер(РасходнаяНакладнаяОбъект.Автор,
		"ФизЛицо", "Справочник");                          
		
		УстановитьНомерДокументаКлиентСервер(РасходнаяНакладнаяОбъект); 
		
		Попытка
			РасходнаяНакладнаяОбъект.Записать();      
			РасходнаяНакладная = РасходнаяНакладнаяОбъект.Ссылка; 
		Исключение          
			СтруктураРезультата.Ошибки.Добавить(СтрШаблон("Не удалось создать новую расходную накладную"));	    
		КонецПопытки;    	
	Иначе	
		РасходнаяНакладнаяОбъект = РасходнаяНакладная.ПолучитьОбъект();
	КонецЕсли;
	
	Если СтруктураРезультата.Ошибки.Количество() = 0 Тогда     
		Результат = ПеренестиТоварыИзОстатковПлановВРНК();
		Если Не Результат.Успешно Тогда
			МаркировкаКС.ДобавитьОшибки(СтруктураРезультата,Результат);
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураРезультата.Ошибки.Количество() > 0 Тогда 
		СтруктураРезультата.Успешно = Ложь;
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции

// Переносит товары из остатков планов продаж в расходную накладную.
//
// Процедура выполняет распределение товаров по плановым продажам:
// 1. Блокирует выбранные планы продаж и расходную накладную
// 2. Получает состав планов с положительными остатками
// 3. Распределяет товары из планов в накладную (учитывая номенклатуру и модель)
// 4. Записывает измененные документы
//
// Возвращаемое значение:
//  Структура - результат операции:
//   * Успешно - Булево - истина, если перенос выполнен без ошибок
//   * Ошибки - Массив Из Строка - описание возникших ошибок при блокировке или записи
//
&НаСервере
Функция ПеренестиТоварыИзОстатковПлановВРНК (); 
	
	СтруктураРезультата = МаркировкаКС.СтруктураРезультата();
	
	МассивПланов = ТаблицаПланов.Выгрузить().ВыгрузитьКолонку("ПланПродаж");    
	
	ТаблицаОбъектовЗаписи = Новый ТаблицаЗначений;
	ТаблицаОбъектовЗаписи.Колонки.Добавить("Объект"); 
	ТаблицаОбъектовЗаписи.Колонки.Добавить("Ссылка"); 
	
	Для Каждого ЭлементМассива Из МассивПланов Цикл      
		Попытка
			ПланОбъект = ЭлементМассива.ПолучитьОбъект();
			ПланОбъект.Заблокировать(); 
		Исключение           
			СтруктураРезультата.Ошибки.Добавить(СтрШаблон("Не удалось заблокировать %1, из-за %2", ПланОбъект, ОписаниеОшибки()));	
		КонецПопытки;
		СтрокаТаблицы = ТаблицаОбъектовЗаписи.Добавить();
		СтрокаТаблицы.Объект = ПланОбъект;
		СтрокаТаблицы.Ссылка = ЭлементМассива;
	КонецЦикла;	       	
	
	Попытка
		РасходнаяНакладнаяОбъект = РасходнаяНакладная.ПолучитьОбъект();
		РасходнаяНакладнаяОбъект.Заблокировать();       
	Исключение           
		СтруктураРезультата.Ошибки.Добавить(СтрШаблон("Не удалось заблокировать %1, из-за %2", РасходнаяНакладнаяОбъект, ОписаниеОшибки()));	
	КонецПопытки;
	
	СтрокаТаблицы = ТаблицаОбъектовЗаписи.Добавить();
	СтрокаТаблицы.Объект = РасходнаяНакладнаяОбъект;
	СтрокаТаблицы.Ссылка = РасходнаяНакладная;
	
	Если СтруктураРезультата.Ошибки.Количество() = 0 Тогда 
		
		Запрос = Новый Запрос;      
		Запрос.УстановитьПараметр("ТоварыСоздаваемойНакладной", Объект.ТоварыСоздаваемойНакладной.Выгрузить());   
		Запрос.УстановитьПараметр("МассивПланов", МассивПланов);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&ТоварыСоздаваемойНакладной КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПланПродажСостав.Ссылка КАК ПланПродаж,   
		|	ПланПродажСостав.Ссылка.Детальный Как Детальный,
		|	ПланПродажСостав.Номенклатура КАК Номенклатура
		|ИЗ
		|	Документ.ПланПродаж.Состав КАК ПланПродажСостав
		|ГДЕ
		|	ПланПродажСостав.Ссылка В(&МассивПланов)
		|	И ПланПродажСостав.КоличествоОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,  
		|	ВТ_Товары.Номенклатура.Родитель КАК Модель,					   
		|	СУММА(ВТ_Товары.Количество) КАК Количество
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Товары.Номенклатура, 
		|	ВТ_Товары.Номенклатура.Родитель";   
		ПакетЗапросов = Запрос.ВыполнитьПакет();
		ВыборкаТоварыПланов = ПакетЗапросов[1].Выгрузить();
		ВыборкаТоварыНакладной = ПакетЗапросов[2].Выбрать();  
		
		Пока ВыборкаТоварыНакладной.Следующий() Цикл                        
			Номенклатура = ВыборкаТоварыНакладной.Номенклатура; 
			Модель = ВыборкаТоварыНакладной.Модель;          
			
			ОсталосьРаспределить = ВыборкаТоварыНакладной.Количество;  
			Распределено = 0;
			
			
			МассивСтрокПланов1 = ВыборкаТоварыПланов.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));   
			МассивСтрокПланов2 = ВыборкаТоварыПланов.НайтиСтроки(Новый Структура("Номенклатура", Модель));
			
			МассивСтрокПланов  = Новый Массив;
			Для Каждого СтрМасс Из МассивСтрокПланов1 Цикл  
				МассивСтрокПланов.Добавить(СтрМасс);
			КонецЦикла;
			Для Каждого СтрМасс Из МассивСтрокПланов2 Цикл  
				МассивСтрокПланов.Добавить(СтрМасс);
			КонецЦикла;
			
			
			
			Для Каждого ТекСтрокаПлана из МассивСтрокПланов Цикл 
				МассивСтрокОбъектов = ТаблицаОбъектовЗаписи.НайтиСтроки(Новый Структура("Ссылка", ТекСтрокаПлана.ПланПродаж));
				Для Каждого СтрокаОбъекта Из МассивСтрокОбъектов Цикл   
					ТекПланОбъект = СтрокаОбъекта.Объект;   
					
					Если ТекСтрокаПлана.Детальный Тогда
						МассивСтрокТЧОбъекта = ТекПланОбъект.Состав.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура)); 
					Иначе
						МассивСтрокТЧОбъекта = ТекПланОбъект.Состав.НайтиСтроки(Новый Структура("Номенклатура", Модель)); 
					КонецЕсли;                   
					
					Для Каждого СтрокаТЧПлана Из МассивСтрокТЧОбъекта Цикл
						Если ОсталосьРаспределить <= 0 Тогда 
							Прервать;
						КонецЕсли;
						Если ОсталосьРаспределить > СтрокаТЧПлана.КоличествоОстаток Тогда 
							ОсталосьРаспределить = ОсталосьРаспределить - СтрокаТЧПлана.КоличествоОстаток;   
							Распределено = Распределено + СтрокаТЧПлана.КоличествоОстаток;
							СтрокаТЧПлана.КоличествоОстаток = 0;
						Иначе      
							СтрокаТЧПлана.КоличествоОстаток = СтрокаТЧПлана.КоличествоОстаток - ОсталосьРаспределить;  
							Распределено = Распределено + ОсталосьРаспределить;
							ОсталосьРаспределить = 0;                  					
						КонецЕсли;					
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			
			Если Распределено Тогда
				СтрокаТЧНакладной = РасходнаяНакладнаяОбъект.Товары.Найти(Номенклатура, "Номенклатура");  		
				Если СтрокаТЧНакладной = Неопределено Тогда
					СтрокаТЧНакладной = РасходнаяНакладнаяОбъект.Товары.Добавить();   
					СтрокаТЧНакладной.Номенклатура = Номенклатура; 
					ПриИзмененииНоменклатурыТабЧасти(СтрокаТЧНакладной, РасходнаяНакладнаяОбъект);
				КонецЕсли;      
				
				СтрокаТЧНакладной.Заявка = СтрокаТЧНакладной.Заявка + Распределено;
				СтрокаТЧНакладной.ПодтвержденнаяЗаявка = СтрокаТЧНакладной.ПодтвержденнаяЗаявка + Распределено;
				СтрокаТЧНакладной.Количество = СтрокаТЧНакладной.Количество + Распределено;	       
				РассчитатьСуммуТабЧасти(СтрокаТЧНакладной, РасходнаяНакладнаяОбъект);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Результат = ВыполнитьЗаписьДокументовСПереносомОстатковПлана(ТаблицаОбъектовЗаписи, МассивПланов);    
		Если Не Результат.Успешно Тогда
			МаркировкаКС.ДобавитьОшибки(СтруктураРезультата,Результат);
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураРезультата.Ошибки.Количество() > 0 Тогда 
		СтруктураРезультата.Успешно = Ложь;
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции   

// Заполняет товары планирования и планы продаж в табличные части формы
//
// Выполняет запрос с параметрами и разделяет полученные данные:
// - сворачивает по номенклатуре с суммированием количества для табличной части ТоварыСоздаваемойНакладной
// - сворачивает по планам продаж для табличной части ТаблицаПланов
&НаСервере
Процедура ЗаполнитьТоварыПланированияДляРНКНаСервере()
	
	Перем ПолнаяТаблица, ВремТаблицаНоменклатуры;
	Запрос = СгенерироватьЗапросСПараметрами();
	ПолнаяТаблица = Запрос.Выполнить().Выгрузить();
	ВремТаблицаНоменклатуры = ПолнаяТаблица.Скопировать();
	ВремТаблицаПланов = ПолнаяТаблица.Скопировать();
	
	ВремТаблицаНоменклатуры.Свернуть("Номенклатура", "Количество");
	ВремТаблицаПланов.Свернуть("ПланПродаж");
	
	Объект.ТоварыСоздаваемойНакладной.Загрузить(ВремТаблицаНоменклатуры);
	ТаблицаПланов.Загрузить(ВремТаблицаПланов);
	
КонецПроцедуры


// Генерирует составной запрос к регистру ОстаткиПлановПродаж с динамическими параметрами для каждого уровня иерархии номенклатуры из табличной части МесяцаПланированияНоменклатуры.
//
// Возвращаемое значение:
//  Запрос - сформированный запрос с параметрами для выборки планов продаж по уровням иерархии номенклатуры
//
&НаСервере
Функция СгенерироватьЗапросСПараметрами()
	
	МассивТекстовСборногоЗапроса = Новый Массив;
	СборныйЗапрос = Новый Запрос;
	СборныйЗапрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	СборныйЗапрос.УстановитьПараметр("ВидПланаПродаж", Объект.ВидПланаПродаж);
	СборныйЗапрос.УстановитьПараметр("НачалоПериода", Объект.НачальныйМесяцПланирования);
	
	ТаблицаПолная = Объект.МесяцаПланированияНоменклатуры.Выгрузить();
	ТаблицаПолная.Сортировать("Порядок");
		
	МассивИсключений = Новый Массив;
	СчетчикВыборки = 1;
	Для Каждого СтрокаУровней Из ТаблицаПолная Цикл
		МассивПоиска = Новый Массив;
		ВременныйМассивИсключений = Новый Массив;
		Для Каждого ЭлементИсключения Из МассивИсключений Цикл
			ВременныйМассивИсключений.Добавить(ЭлементИсключения);
		КонецЦикла;
		
		Если СчетчикВыборки > 1 Тогда
			МассивТекстовСборногоЗапроса.Добавить("
			|ОБЪЕДИНИТЬ ВСЕ 
			|");
		КонецЕсли;
		
		КусочекТекстаСборногоЗапроса = СтрШаблон("ВЫБРАТЬ
		|	ПланПродаж.Номенклатура КАК Номенклатура,
		|	ПланПродаж.Регистратор КАК ПланПродаж,
		|	СУММА(ПланПродаж.Количество) КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиПлановПродаж КАК ПланПродаж
		|ГДЕ
		|	ПланПродаж.Контрагент = &Контрагент
		|	И ПланПродаж.Номенклатура В ИЕРАРХИИ (&МассивПоискаНоменклатуры%1)
		|	И ПланПродаж.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода%1
		|	И НЕ ПланПродаж.Номенклатура В ИЕРАРХИИ (&МассивИсключений%1)
		|	И ПланПродаж.Регистратор.ВидПланаПродаж = &ВидПланаПродаж    
		|	И ПланПродаж.Регистратор ССЫЛКА Документ.ПланПродаж
		|СГРУППИРОВАТЬ ПО
		|ПланПродаж.Номенклатура,
		|ПланПродаж.Регистратор
		|", СчетчикВыборки);
			
		МассивТекстовСборногоЗапроса.Добавить(КусочекТекстаСборногоЗапроса);
		МассивПоиска.Добавить(СтрокаУровней.Номенклатура);
		МассивИсключений.Добавить(СтрокаУровней.Номенклатура);
		
		СборныйЗапрос.УстановитьПараметр(СтрШаблон("МассивПоискаНоменклатуры%1", СчетчикВыборки),
		МассивПоиска);
		СборныйЗапрос.УстановитьПараметр(СтрШаблон("МассивИсключений%1", СчетчикВыборки),
		ВременныйМассивИсключений);
		СборныйЗапрос.УстановитьПараметр(СтрШаблон("ОкончаниеПериода%1", СчетчикВыборки),
		ДобавитьМесяц(Объект.НачальныйМесяцПланирования, СтрокаУровней.КоличествоМесяцев)-1);			
		
		СчетчикВыборки = СчетчикВыборки + 1;
	КонецЦикла;
	
	СборныйЗапрос.Текст = СтрСоединить(МассивТекстовСборногоЗапроса, "");
	Возврат СборныйЗапрос;
	
КонецФункции

#КонецОбласти
